[
    {
        "id": 3,
        "title": "FilmForum",
        "date": "31-08-2025",
        "semester": "Sophomore",
        "banner": "images/projects/Homepage.png",
        "summary": "Professional web development techs in the palm of my hand",
        "content": "A film forum website where users can discover movies, write blogs, share reviews, and connect with a movie-loving community. This repository contains the frontend (React/Next.js) of the project. The backend is private, but you can see the functionality via screenshots.",
        "link": "https://github.com/Dreckiez/FilmForum-Frontend"
    },
    {
        "id": 2,
        "title": "File Transfer",
        "date": "31-08-2024",
        "semester": "Freshman",
        "banner": "images/projects/Socket.gif",
        "summary": "Got to learn about Python and Socket Programming",
        "content": "This is a small project for the Computer Networking course i took. Its goal is to create a Server-Client program for file transfering with 2 parts, each part has different requirements.<br>Honestly, I had a pretty rough time coding this project. Since, I had to learn Python (cuz i wanna try it out) and other stuffs about Socket Programming.",
        "link": "https://github.com/Dreckiez/File-Transfer-Python"
    },
    {
        "id": 1,
        "title": "Pokemon Matching Game",
        "date": "30-04-2024",
        "semester": "Freshman",
        "banner": "images/projects/Pokemon.png",
        "summary": "Recreation of a childhood game",
        "content": "This is a mini project for my Programming Techniques subject. The project's purpose was to test my understandings and knowledge about 2D pointer and Linked List as well as my programming skills.<br>This project was created based on the Raylib library. I chose it because it seems like a modern and easy-to-use library for videogames programming with many handy functions for visualization.",
        "link": "https://github.com/Dreckiez/Pokemon-Matching-Game"
    }
]